Documents/омг_СпискиУслугДляРасчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>омг_СпискиУслугДляРасчетаЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.омг_НоменклатураИзСписковДляЗарплаты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УслугиПодробно</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходнаяУслугаГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УниверсальныйСписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/омг_СпискиУслугДляРасчетаЗарплаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПодборНом(Команда)

	СписокОтбор = Новый СписокЗначений;
	
	Если Объект.ТипДокумента = 0 Тогда
		
		Для Каждого СтрокаТаблицы Из Объект.Услуги Цикл 
			
			СписокОтбор.Добавить(СтрокаТаблицы.Услуга)
			
		КонецЦикла;        
		
		ТипЭлемента = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
		
		Представление =  "Номенклатура";
		
	ИначеЕсли Объект.ТипДокумента = 1 Тогда 
		
		Для Каждого СтрокаТаблицы Из Объект.Контрагенты Цикл 
			
			СписокОтбор.Добавить(СтрокаТаблицы.Контрагент)
			
		КонецЦикла;
		   	
		ТипЭлемента = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		
		Представление =  "Контрагент";
		
	ИначеЕсли Объект.ТипДокумента = 2 Тогда
		
		Для Каждого СтрокаТаблицы Из Объект.Сотрудники Цикл 
			
			СписокОтбор.Добавить(СтрокаТаблицы.Сотрудник)
			
		КонецЦикла;
		     	
		ТипЭлемента = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");  
		
		Представление =  "Сотрудник";
		
	ИначеЕсли Объект.ТипДокумента = 3 Тогда  
		
		Для Каждого СтрокаТаблицы Из Объект.Клиенты Цикл 
			
			СписокОтбор.Добавить(СтрокаТаблицы.Клиент)
			
		КонецЦикла;
		   	
		ТипЭлемента = Новый ОписаниеТипов("СправочникСсылка.Клиенты");
		
		Представление =  "Клиент";
		
	КонецЕсли;


	ПараметрыВыбора2 = Новый Структура();
	
	ПараметрыВыбора2.Вставить("БыстрыйВыбор",Ложь);
	ПараметрыВыбора2.Вставить("ВводСписком",Истина);  
	ПараметрыВыбора2.Вставить("ВыборГруппИЭлементов",ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	ПараметрыВыбора2.Вставить("ЗакрыватьПриВыборе",Истина);
	ПараметрыВыбора2.Вставить("ЗакрыватьПриЗакрытииВладельца",Истина);
	ПараметрыВыбора2.Вставить("ЗначенияДляВыбора",Новый СписокЗначений);
	ПараметрыВыбора2.Вставить("ЗначенияДляВыбораЗаполнены",Ложь);
	ПараметрыВыбора2.Вставить("КлючУникальности","");
	ПараметрыВыбора2.Вставить("МножественныйВыбор",Истина);
	ПараметрыВыбора2.Вставить("ОграничиватьВыборУказаннымиЗначениями",Ложь);
	ПараметрыВыбора2.Вставить("ОписаниеТипов",ТипЭлемента);
	ПараметрыВыбора2.Вставить("Отбор",Новый Структура);
	ПараметрыВыбора2.Вставить("ПараметрыВыбора",Новый Массив);
	ПараметрыВыбора2.Вставить("ПутьКФорме","");
	ПараметрыВыбора2.Вставить("РазрешитьНачалоПеретаскивания",Ложь);
	ПараметрыВыбора2.Вставить("РежимВыбора",Истина);
	ПараметрыВыбора2.Вставить("РежимОткрытияОкна",РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
	ПараметрыОбработчика = Новый Структура; 
	
	Обработчик = Новый ОписаниеОповещения("ОтборыЗавершениеВводаСпискомСФлажками", ЭтотОбъект, ПараметрыОбработчика);
	
	ПараметрыВыбора2.Вставить("Отмеченные",    СписокОтбор);
	ПараметрыВыбора2.Вставить("Представление", Представление);
	
	Блокировать = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФорму("ОбщаяФорма.ВводЗначенийСпискомСФлажками", ПараметрыВыбора2, ЭтотОбъект, , , , Обработчик, Блокировать);

КонецПроцедуры

&НаКлиенте
Процедура ОтборыЗавершениеВводаСпискомСФлажками(РезультатВыбора, Контекст) Экспорт
	
	Если ТипЗнч(РезультатВыбора) <> Тип("СписокЗначений") Тогда
		Возврат; 
	иначе  
		
		Если Объект.ТипДокумента = 0 Тогда
			
			Объект.Услуги.Очистить();
			Для каждого строка из РезультатВыбора Цикл
				НоваяСтрока = Объект.Услуги.Добавить();
				НоваяСтрока.Услуга = строка.Значение; 
			КонецЦикла;	
			
		ИначеЕсли Объект.ТипДокумента = 1 Тогда 
			
			Объект.Контрагенты.Очистить();
			Для каждого строка из РезультатВыбора Цикл
				НоваяСтрока = Объект.Контрагенты.Добавить();
				НоваяСтрока.Контрагент = строка.Значение; 
			КонецЦикла;	
			
		ИначеЕсли Объект.ТипДокумента = 2 Тогда
			
			Объект.Сотрудники.Очистить();
			Для каждого строка из РезультатВыбора Цикл
				НоваяСтрока = Объект.Сотрудники.Добавить();
				НоваяСтрока.Сотрудник = строка.Значение; 
			КонецЦикла;
			
		ИначеЕсли Объект.ТипДокумента = 3 Тогда  
			
			Объект.Клиенты.Очистить();
			Для каждого строка из РезультатВыбора Цикл
				НоваяСтрока = Объект.Клиенты.Добавить();
				НоваяСтрока.Клиент = строка.Значение; 
			КонецЦикла;
			
		КонецЕсли; 
		
	КонецЕсли;  
	
КонецПроцедуры		

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	
	ОтображениеТаблиц()

КонецПроцедуры

&НаКлиенте
Процедура ОтображениеТаблиц()
	
	Элементы.Услуги.Видимость = Ложь;
	Элементы.Контрагенты.Видимость = Ложь;
	Элементы.УниверсальныйСписок.Видимость = Ложь;
	Элементы.Клиенты.Видимость = Ложь;
	Элементы.Сотрудники.Видимость = Ложь;
	
	Если Объект.ТипДокумента = 0 Тогда
		
		Элементы.Услуги.Видимость = Истина;
		
	ИначеЕсли Объект.ТипДокумента = 1 Тогда 
		
		Элементы.Контрагенты.Видимость = Истина;
		
	ИначеЕсли Объект.ТипДокумента = 2 Тогда
		
		Элементы.Сотрудники.Видимость = Истина;
		
	ИначеЕсли Объект.ТипДокумента = 3 Тогда  
		
		Элементы.Клиенты.Видимость = Истина;
		
	ИначеЕсли Объект.ТипДокумента = 4 Тогда 
		
		Элементы.УниверсальныйСписок.Видимость = Истина;
				
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтображениеТаблиц()
	
КонецПроцедуры
